In [74]:
path_to_zip_file = "datasets.zip"
direcyory_to_extract_to = ""

import zipfile
zip_ref = zipfile.ZipFile(path_to_zip_file,'r')
zip_ref.extractall(direcyory_to_extract_to)
zip_ref.close()
print('Done!')

Done!

In [75]:
import pandas as pd
Location = "datasets/smallgradesh.csv"
df = pd.read_csv(Location, header=None)
print('Done!')

Done!

In [76]:
df.head()

         0      1
0     Name  Grade
1   Marcia   82.4
2   Kadeem   78.2
3     Nash   79.3
4  Noelani   83.2

In [77]:
import pandas as pd
Location = "datasets/smallgradesh.csv"
df = pd.read_csv(Location, names= ['Names','Grades'])

In [37]:
df.columns = ['Names','Grades2']

In [78]:
df.head()

     Names Grades
0     Name  Grade
1   Marcia   82.4
2   Kadeem   78.2
3     Nash   79.3
4  Noelani   83.2

In [79]:
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
print('Done!')

Done!

In [80]:
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [81]:
import pandas as pd
Location = "datasets/statecalifornia.csv"
df = pd.read_csv(Location)
print('Done!')

Done!

In [82]:
df.head()

,GEOID,SUMLEV,STATE,COUNTY,CBSA,CSA,NECTA,CNECTA,NAME,POP100,HU100,POP100.2000,HU100.2000,P001001,P001001.2000
0,6,40,6,NaN,NaN,NaN,NaN,NaN,California,37253956,13680081,33871648,12214549,37253956,33871648

In [83]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]

listNames = [['Bob',76],['Jessica',95],['Mary',77],['John',78],['Mel',99]]

df = pd.DataFrame(data = listNames, columns =['Names','Grades'])

df.to_csv('studentgrades.csv',index=False,header=False)
print('Done!')

Done!

In [84]:
df.head()

     Names  Grades
0      Bob      76
1  Jessica      95
2     Mary      77
3     John      78
4      Mel      99

In [85]:
import pandas as pd
Location = "datasets/gradedata.xlsx"
df = pd.read_excel(Location)

In [86]:
df.columns = ['first','last','sex','age','exer','hrs','grd','addr']

In [87]:
df.head()

,first,last,sex,age,exer,hrs,grd,addr
0,Marcia,Pugh,female,17,3,10,82.4,"7379 Highland Rd. , Dublin, GA 31021"
1,Kadeem,Morrison,male,18,4,4,78.2,"8 Bayport St. , Honolulu, HI 96815"
2,Nash,Powell,male,18,5,9,79.3,"Encino, CA 91316, 3 Lilac Street"
3,Noelani,Wagner,female,14,2,7,83.2,"Riverview, FL 33569, 9998 North Smith Dr."
4,Noelani,Cherry,female,18,4,15,87.4,"97 SE. Ocean Street , Bethlehem, PA 18015"

In [90]:
import pandas as pd
listData = [['Bob',76],['Jessica',95],['Mary',77],['John',78],['Mel',99]]
columnsName = ['Names','Grades']
df = pd.DataFrame(data = listData, columns = columnsName)
writer = pd.ExcelWriter('dataframe.xlsx',engine="xlsxwriter")
df.to_excel(writer,sheet_name="Sheet1")
writer.save()
print('Done!')

Done!

In [89]:
df.head()

     Names  Grades
0      Bob      76
1  Jessica      95
2     Mary      77
3     John      78
4      Mel      99

In [93]:
import pandas as pd

columnsName = ['Names','Grades']

listData = [['Bob',76],['Jessica',95],['Mary',77],['John',78],['Mel',99]]
df = pd.DataFrame(data = listData, columns = columnsName)

listData = [['Eze',76],['Luu',95],['Mike',77],['Jim',78],['Lin',99]]
df2 = pd.DataFrame(data = listData, columns = columnsName)

writer = pd.ExcelWriter('dataframemultiple.xlsx',engine="xlsxwriter")
df.to_excel(writer,sheet_name="Sheet1")
df2.to_excel(writer,sheet_name="Sheet2")
writer.save()
print('Done!')

Done!

In [94]:
import pandas as pd
import numpy as np

all_data = pd.DataFrame()

df = pd.read_excel("datasets/data1.xlsx")
all_data = all_data.append(df,ignore_index=True)

df = pd.read_excel("datasets/data2.xlsx")
all_data = all_data.append(df,ignore_index=True)

df = pd.read_excel("datasets/data3.xlsx")
all_data = all_data.append(df,ignore_index=True)

all_data.describe()

print('Done!')

Done!

In [96]:
print(df)

       fname  age  grade
0     Aretha   18     86
1      Amber   18     65
2     Serena   14     71
3       Jada   14     99
4     Althea   19    100
5       Nina   16     66
6    Cynthia   18     80
7      Heidi   16     65
8   Jermaine   19     96
9       Quyn   14     69
10    Hayden   16     72
11   Anthony   18     68
12   Leandra   16     66
13   Giselle   14     72
14     Brian   14     76
15     Rhoda   18     92
16    Yoshio   17     76
17   Graiden   15     73
18   Shannon   17     73
19      Maia   17     73
20    Lester   14     78
21   Alfreda   19     81
22     Tyler   19     83
23    Sloane   17     96
24    Jemima   17     67
25     Emery   16     65
26     Stacy   15     94
27      Zena   19     87
28     Donna   14     87
29    Vernon   15     72
..       ...  ...    ...
70    Gloria   15     96
71     Alexa   14     93
72  Kathleen   17     78
73   Neville   19     69
74     Ahmed   15     75
75   Anjolie   19     88
76  Garrison   18     91
77      Lacy   14     69
78     Hayes   14     89
79    Kasper   19     82
80    Vielka   19     97
81      Gray   16     84
82     Maggy   14     76
83    Yoshio   14     85
84    Jakeem   15     75
85      Olga   16     67
86      Eden   15     74
87      Sara   17     92
88   Randall   19     96
89     Felix   15     95
90    Stacey   19     65
91   Leonard   17     82
92     Chaim   15     87
93   Hammett   18     82
94   Chester   15     71
95     Clare   17     69
96      Sade   14     85
97   Michael   16     91
98     Ocean   15     98
99     Wanda   17     97

[100 rows x 3 columns]

In [110]:
import pandas as pd
import numpy as np
import glob

all_data = pd.DataFrame()
for f in glob.glob("datasets/data*.xlsx"):
    df = pd.read_excel(f)
    all_data = all_data.append(df,ignore_index = True)

print('Done!')

Done!

In [111]:
print(all_data.describe())
print(df.head())

              age       grade
count  300.000000  300.000000
mean    16.456667   82.923333
std      1.700321   10.544576
min     14.000000   65.000000
25%     15.000000   73.750000
50%     16.000000   82.000000
75%     18.000000   92.000000
max     19.000000  100.000000
    fname  age  grade
0  Aretha   18     86
1   Amber   18     65
2  Serena   14     71
3    Jada   14     99
4  Althea   19    100

In [121]:
import pandas as pd
import numpy as np
import glob

all_data = pd.DataFrame()
for f in glob.glob("datasets/weekly_call_data/weekdata_*.xlsx"):
    print("\r Processing: "+ f, end="")
    df = pd.read_excel(f)
    all_data = all_data.append(df,ignore_index = True)

print('')
print('Done!')

 Processing: datasets/weekly_call_data\weekdata_103.xlsx
Done!

In [122]:
print(all_data.describe())
print(df.head())

        CallDuration
count  129588.000000
mean       12.517147
std         6.925404
min         1.000000
25%         7.000000
50%        13.000000
75%        19.000000
max        24.000000
  CallingNumber DayOfWeek TimeOfDay  CallDuration      ReasonForCall  \
0  141-471-0978       tue     09:06            14  Technical Support
1  316-174-6528       tue     12:06             8  Technical Support
2  310-757-1063       fri     11:53            21             Return
3  206-612-2605       mon     10:56             5          Complaint
4  127-215-2713       fri     15:59            24             Return

  AnsweringAgent
0          Nicki
1          Maria
2        Kennedy
3         Roland
4        Gregory